m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/hal/inc/fsl_xbar_signals.h
    kXbaraInputHSADC1_CCA = 32|0x100U, /*!< High Speed Analog-to-Digital Converter 0 conversion A complete output assigned to XBARA_IN32 input. */
    kXbaraInputHSADC0_CCA = 33|0x100U, /*!< High Speed Analog-to-Digital Converter 1 conversion A complete output assigned to XBARA_IN33 input. */
    kXbaraInputHSADC1_CCB = 34|0x100U, /*!< High Speed Analog-to-Digital Converter 0 conversion B complete output assigned to XBARA_IN34 input. */
    kXbaraInputHSADC0_CCB = 35|0x100U, /*!< High Speed Analog-to-Digital Converter 1 conversion B complete output assigned to XBARA_IN35 input. */
    kXbaraInputFTM1_match = 36|0x100U, /*!< FTM1 all channels output compare ORed together output assigned to XBARA_IN36 input. */
    kXbaraInputFTM1_EXTRIG = 37|0x100U, /*!< FTM1 all channels counter init ORed together output assigned to XBARA_IN37 input. */
    kXbaraInputDMA_CH0_done = 38|0x100U, /*!< DMA channel 0 done output assigned to XBARA_IN38 input. */
    kXbaraInputDMA_CH1_done = 39|0x100U, /*!< DMA channel 1 done output assigned to XBARA_IN39 input. */
    kXbaraInputDMA_CH6_done = 40|0x100U, /*!< DMA channel 6 done output assigned to XBARA_IN40 input. */
    kXbaraInputDMA_CH7_done = 41|0x100U, /*!< DMA channel 7 done output assigned to XBARA_IN41 input. */
    kXbaraInputPIT_trigger_0 = 42|0x100U, /*!< PIT trigger 0 output assigned to XBARA_IN42 input. */
    kXbaraInputPIT_trigger_1 = 43|0x100U, /*!< PIT trigger 1 output assigned to XBARA_IN43 input. */
    kXbaraInputADC0_COCO = 44|0x100U, /*!< Analog-to-Digital Converter 0 conversion complete output assigned to XBARA_IN44 input. */
    kXbaraInputENC_CMP_pos_match = 45|0x100U, /*!< ENC compare trigger and position match output assigned to XBARA_IN45 input. */
    kXbaraInputAND_OR_INVERT_0 = 46|0x100U, /*!< AOI output 0 output assigned to XBARA_IN46 input. */
    kXbaraInputAND_OR_INVERT_1 = 47|0x100U, /*!< AOI output 1 output assigned to XBARA_IN47 input. */
    kXbaraInputAND_OR_INVERT_2 = 48|0x100U, /*!< AOI output 2 output assigned to XBARA_IN48 input. */
    kXbaraInputAND_OR_INVERT_3 = 49|0x100U, /*!< AOI output 3 output assigned to XBARA_IN49 input. */
    kXbaraInputPIT_trigger_2 = 50|0x100U, /*!< PIT trigger 2 output assigned to XBARA_IN50 input. */
    kXbaraInputPIT_trigger_3 = 51|0x100U, /*!< PIT trigger 3 output assigned to XBARA_IN51 input. */
    kXbaraInputPWM1_CH0_TRG0_or_TRG1 = 52|0x100U, /*!< PWMB channel 0 trigger 0 or trigger 1 output assigned to XBARA_IN52 input. */
    kXbaraInputPWM1_CH1_TRG0_or_TRG1 = 53|0x100U, /*!< PWMB channel 1 trigger 0 or trigger 1 output assigned to XBARA_IN53 input. */
    kXbaraInputPWM1_CH2_TRG0_or_TRG1 = 54|0x100U, /*!< PWMB channel 2 trigger 0 or trigger 1 output assigned to XBARA_IN54 input. */
    kXbaraInputPWM1_CH3_TRG0_or_TRG1 = 55|0x100U, /*!< PWMB channel 3 trigger 0 or trigger 1 output assigned to XBARA_IN55 input. */
    kXbaraInputFTM2_match = 56|0x100U, /*!< FTM2 all channels output compare ORed together output assigned to XBARA_IN56 input. */
    kXbaraInputFTM2_EXTRIG = 57|0x100U, /*!< FTM2 all channels counter init ORed together output assigned to XBARA_IN57 input. */
    kXbarbInputCMP0_output = 0|0x200U, /*!< CMP0 Output output assigned to XBARB_IN0 input. */
    kXbarbInputCMP1_output = 1|0x200U, /*!< CMP1 Output output assigned to XBARB_IN1 input. */
    kXbarbInputCMP2_output = 2|0x200U, /*!< CMP2 Output output assigned to XBARB_IN2 input. */
    kXbarbInputCMP3_output = 3|0x200U, /*!< CMP3 Output output assigned to XBARB_IN3 input. */
    kXbarbInputFTM0_match = 4|0x200U, /*!< FTM0 all channels output compare ORed together output assigned to XBARB_IN4 input. */
    kXbarbInputFTM0_EXTRIG = 5|0x200U, /*!< FTM0 all channels counter init ORed together output assigned to XBARB_IN5 input. */
    kXbarbInputFTM3_match = 6|0x200U, /*!< FTM3 all channels output compare ORed together output assigned to XBARB_IN6 input. */
    kXbarbInputFTM3_EXTRIG = 7|0x200U, /*!< FTM3 all channels counter init ORed together output assigned to XBARB_IN7 input. */
    kXbarbInputPWM0_CH0_TRG0 = 8|0x200U, /*!< PWMA channel 0 trigger 0 output assigned to XBARB_IN8 input. */
    kXbarbInputPWM0_CH1_TRG0 = 9|0x200U, /*!< PWMA channel 1 trigger 0 output assigned to XBARB_IN9 input. */
    kXbarbInputPWM0_CH2_TRG0 = 10|0x200U, /*!< PWMA channel 2 trigger 0 output assigned to XBARB_IN10 input. */
    kXbarbInputPWM0_CH3_TRG0 = 11|0x200U, /*!< PWMA channel 3 trigger 0 output assigned to XBARB_IN11 input. */
    kXbarbInputPDB0_CH0_Output = 12|0x200U, /*!< PDB0 channel 0 output trigger output assigned to XBARB_IN12 input. */
    kXbarbInputHSADC0_CCA = 13|0x200U, /*!< High Speed Analog-to-Digital Converter 1 conversion A complete output assigned to XBARB_IN13 input. */
    kXbarbInputXBARIN2 = 14|0x200U, /*!< XBAR0_IN2 input pin output assigned to XBARB_IN14 input. */
    kXbarbInputXBARIN3 = 15|0x200U, /*!< XBAR0_IN3 input pin output assigned to XBARB_IN15 input. */
    kXbarbInputFTM1_match = 16|0x200U, /*!< FTM1 all channels output compare ORed together output assigned to XBARB_IN16 input. */
    kXbarbInputFTM1_EXTRIG = 17|0x200U, /*!< FTM1 all channels counter init ORed together output assigned to XBARB_IN17 input. */
    kXbarbInputDMA_CH0_done = 18|0x200U, /*!< DMA channel 0 done output assigned to XBARB_IN18 input. */
    kXbarbInputDMA_CH1_done = 19|0x200U, /*!< DMA channel 1 done output assigned to XBARB_IN19 input. */
    kXbarbInputXBARIN10 = 20|0x200U, /*!< XBAR0_IN10 input pin output assigned to XBARB_IN20 input. */
    kXbarbInputXBARIN11 = 21|0x200U, /*!< XBAR0_IN11 input pin output assigned to XBARB_IN21 input. */
    kXbarbInputDMA_CH6_done = 22|0x200U, /*!< DMA channel 6 done output assigned to XBARB_IN22 input. */
    kXbarbInputDMA_CH7_done = 23|0x200U, /*!< DMA channel 7 done output assigned to XBARB_IN23 input. */
    kXbarbInputPIT_trigger_0 = 24|0x200U, /*!< PIT trigger 0 output assigned to XBARB_IN24 input. */
    kXbarbInputPIT_trigger_1 = 25|0x200U, /*!< PIT trigger 1 output assigned to XBARB_IN25 input. */
    kXbarbInputPDB1_CH0_Output = 26|0x200U, /*!< PDB1 channel 0 output trigger output assigned to XBARB_IN26 input. */
    kXbarbInputHSADC0_CCB = 27|0x200U, /*!< High Speed Analog-to-Digital Converter 1 conversion B complete output assigned to XBARB_IN27 input. */
    kXbarbInputPWM1_CH0_TRG0_or_TRG1 = 28|0x200U, /*!< PWMB channel 0 trigger 0 or trigger 1 output assigned to XBARB_IN28 input. */
    kXbarbInputPWM1_CH1_TRG0_or_TRG1 = 29|0x200U, /*!< PWMB channel 1 trigger 0 or trigger 1 output assigned to XBARB_IN29 input. */
    kXbarbInputPWM1_CH2_TRG0_or_TRG1 = 30|0x200U, /*!< PWMB channel 2 trigger 0 or trigger 1 output assigned to XBARB_IN30 input. */
    kXbarbInputPWM1_CH3_TRG0_or_TRG1 = 31|0x200U, /*!< PWMB channel 3 trigger 0 or trigger 1 output assigned to XBARB_IN31 input. */
    kXbarbInputFTM2_match = 32|0x200U, /*!< FTM2 all channels output compare ORed together output assigned to XBARB_IN32 input. */
    kXbarbInputFTM2_EXTRIG = 33|0x200U, /*!< FTM2 all channels counter init ORed together output assigned to XBARB_IN33 input. */
    kXbarbInputPDB0_CH1_Output = 34|0x200U, /*!< PDB0 channel 1 output trigger output assigned to XBARB_IN34 input. */
    kXbarbInputPDB1_CH1_Output = 35|0x200U, /*!< PDB1 channel 1 output trigger output assigned to XBARB_IN35 input. */
    kXbarbInputHSADC1_CCA = 36|0x200U, /*!< High Speed Analog-to-Digital Converter 0 conversion A complete output assigned to XBARB_IN36 input. */
    kXbarbInputHSADC1_CCB = 37|0x200U, /*!< High Speed Analog-to-Digital Converter 0 conversion B complete output assigned to XBARB_IN37 input. */
    kXbarbInputADC0_COCO = 38|0x200U, /*!< Analog-to-Digital Converter 0 conversion complete output assigned to XBARB_IN38 input. */
#else
    #error "No valid CPU defined!"
#endif
} xbar_input_signal_t;

